{
  "id": 475,
  "title": "Genshin Impact",
  "thumbnail": "https://www.freetogame.com/g/475/thumbnail.jpg",
  "status": "Live",
  "short_description": "If you’ve been looking for a game to scratch that open-world action RPG itch, one with perhaps a bit of Asian flair, then you’re going to want to check out miHoYo’s Genshin Impact.",
  "description": "If you’ve been looking for a game to scratch that open-world ARPG itch, one with perhaps a bit of Asian flair, then you’re going to want to check out miHoYo’s Genshin Impact. The developer, known previously for Honkai Impact 3rd, take players to the world of Teyvat, a vast open-world designed for extended exploration. Players not only explore dungeons, but climb mountains, trees, and buildings to discover all kinds of secrets. \r\n\r\nOf course, the main character doesn’t travel alone. Instead, players build a four-player group out of over 20 characters that can be swapped out to create the best group for any particular mission. The characters, each with different skills filling out the classic RPG types as well as distinct elemental focuses, can be obtained via gameplay or the game’s gacha mechanics – as is gear. Both characters and gear are upgraded in the game via the in depth crafting system.\r\n\r\nIn addition, the game offers players an adventurer system that provides them with even more to do, be it daily quests, small favors for the locals, or big continent-traveling quests. The adventurer system also rewards players for their activities with a wide variety of items.\r\n\r\nGenshin Impact is available to players on PC, PlayStation 4, and mobile devices. It also features a multiplayer mode allowing up to four players to play together and cross-play across all four platforms, however, PlayStation 4 does not allow for cross-progression.",
  "game_url": "https://www.freetogame.com/open/genshin-impact",
  "genre": "Action RPG",
  "platform": "Windows",
  "publisher": "miHoYo",
  "developer": "miHoYo",
  "release_date": "2020-09-28",
  "freetogame_profile_url": "https://www.freetogame.com/genshin-impact",
  "screenshots": [
    {
      "id": 1191,
      "image": "https://www.freetogame.com/g/475/genshin-impact-1.jpg"
    },
    {
      "id": 1192,
      "image": "https://www.freetogame.com/g/475/genshin-impact-2.jpg"
    },
    {
      "id": 1193,
      "image": "https://www.freetogame.com/g/475/genshin-impact-3.jpg"
    }
  ]
}